#define _CRT_SECURE_NO_WARNINGS 1
/*
输入一个整数数组，实现一个函数，
来调整该数组中数字的顺序使得数组中所有的奇数位于数组的前半部分，
所有偶数位于数组的后半部分。
*/
#include<stdio.h>
#include<stdlib.h>

int main()
{
//法一-----------------------------------------------------------------------------------
	int a1[] = { 0, 1, 2, 3, 4, 5, 6, 7, 8, 9 };
	int s[10];
	int d[10];
	int i1;
	int counts = 0;
	int countd = 0;
	for (i1 = 0; i1 < 10; i1++)
	{
		if (a1[i1] % 2)
		{
			s[counts++] = a1[i1];
		}
		else
		{
			d[countd++] = a1[i1];
		}
	}
	for (i1 = 0; i1 < counts; i1++)
	{
		a1[i1] = s[i1];
	}
	for (i1 = 0; i1 < countd; i1++)
	{
		a1[counts + i1] = d[i1];
	}
	for (int i1 = 0; i1 < 10; i1++)
	{
		printf("%d ", a1[i1]);
	}
	putchar('\n');
//法二-----------------------------------------------------------------------------------

	int a2[] = { 0, 1, 2, 3, 4, 5, 6, 7, 8, 9 };
	int i2 = 0, j2 = 9, tmp1;
	while (1)
	{
		while (a2[i2++] % 2);
		while (a2[j2--] % 2 == 0);
		tmp1 = a2[i2 - 1];
		a2[i2 - 1] = a2[j2 + 1];
		a2[j2 + 1] = tmp1;
		if (i2 - 1 >= j2 + 1)
		{
			break;
		}
	}
	for (int i2 = 0; i2 < 10; i2++)
	{
		printf("%d ", a2[i2]);
	}
	putchar('\n');
//法三-----------------------------------------------------------------------------------
	int a3[] = { 0, 1, 2, 3, 4, 5, 6, 7, 8, 9 };
	int i3 = 0, j3 = 9, tmp2;

	while (a3[i3++] % 2 && i3 < 10);//全部奇数或者全部偶数不进入循环&&不可能存在交换一次之后还是全奇数或者全偶数
	while (a3[j3--] % 2 == 0 && j3 > 0);
	while (i3 - 1 < j3 + 1)
	{
		tmp2 = a3[i3 - 1];
		a3[i3 - 1] = a3[j3 + 1];
		a3[j3 + 1] = tmp2;
		while (a3[i3++] % 2);
		while (a3[j3--] % 2 == 0);
	}

	for (int i3 = 0; i3 < 10; i3++)
	{
		printf("%d ", a3[i3]);
	}
	putchar('\n');
	system("pause");
	return 0;
}

